# -*- org-confirm-babel-evaluate: nil -*-
#+TITLE: Phundrak’s fish config
#+INCLUDE: headers.org
#+OPTIONS: auto-id:t
#+HTML_HEAD_EXTRA: <meta name="description" content="Phundrak's fish config" />
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Phundrak's fish config" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="Description of the fish config file of Phundrak" />
#+PROPERTY: header-args:fish :tangle ~/.config/fish/config.fish :exports code :noweb yes
#+PROPERTY: header-args :exports code :tangle no
#+STARTUP: content

* Global variables
  :PROPERTIES:
  :CUSTOM_ID: h-0eff37da-af9f-4546-8ad3-201961a2200f
  :END:
  Some global variables might sometimes be needed and need to be modified. This
  is for example the case with my =PATH= variable in which I add Rust’s Cargo’s
  binaries, Go’s binaries  and my own executables. And of  course, don’t forget
  to add the already existing =PATH=.

  #+NAME: extra-paths
  | additional path           | what it leads to                     |
  |---------------------------+--------------------------------------|
  | $HOME/.pub-cache/bin      | Dart binaries and executables        |
  | $HOME/.local/bin          | Custom executables, see [[file:bin.org]] |
  | $HOME/go/bin              | Go binaries and executables          |
  | $HOME/.cargo/bin          | Rust binaries and executables        |
  | $HOME/.gem/ruby/2.6.0/bin | Ruby binaries and executables        |

  #+NAME: generate-extra-paths
  #+BEGIN_SRC emacs-lisp :var paths=extra-paths[,0] :exports none :cache yes
    (mapconcat (lambda (x) x)
               paths " ")
  #+END_SRC

  #+RESULTS[d6cf1e9d562d644db1bc6458eca1fc165b065f0c]: generate-extra-paths
  : $HOME/.pub-cache/bin $HOME/.local/bin $HOME/go/bin $HOME/.cargo/bin $HOME/.gem/ruby/2.6.0/bin

  #+BEGIN_SRC fish :noweb yes
    set -gx PATH <<generate-extra-paths()>> $PATH
  #+END_SRC

  Sometimes, software  will rely on =SUDO_ASKPASS=  to get a GUI  from which it
  can get the sudo password. So, let’s declare it.
  #+BEGIN_SRC fish
    set -gx SUDO_ASKPASS ~/.local/bin/askpass
  #+END_SRC

  Now, let’s declare  our editor of choice, EmacsClient; not  Emacs itself since
  it will  most often be just  quick edits, nothing  too heavy, if it  is called
  from the =EDITOR= variable (from Git, for example).
  #+BEGIN_SRC fish
    set -gx EDITOR emacsclient -c
  #+END_SRC

  We also need to set the path to the Dart SDK.
  #+BEGIN_SRC fish
  set -gx DART_SDK /opt/dart-sdk/bin
  #+END_SRC

  And we also need to specify where the Android SDK it located.
  #+BEGIN_SRC fish
  set -gx ANDROID_HOME $HOME/Android/Sdk
  #+END_SRC

  Finally, some development  packages require the =PKG_CONFIG_PATH=  to be set,
  so let’s do so.
  #+BEGIN_SRC fish
    set -gx PKG_CONFIG_PATH /usr/local/lib/pkgconfig/ $PKG_CONFIG_PATH
  #+END_SRC

